app/controllers/customers_controller.rb

    def create
        @customer = Customer.new(customer_params)
        if @customer.save
---
INSERT INTO `customers` (`cname`, `caddress`, `ccontactn`, `ccontactp`, `cpayment`, `cnotes`, `created_at`, `updated_at`) VALUES ('cust', 'add', 'cont', '09123124123', 'pay', '', '2018-04-30 15:03:07', '2018-04-30 15:03:07')

    def update
        if @customer.update(customer_params)
---
UPDATE `customers` SET `ccontactn` = 'contact number', `updated_at` = '2018-04-30 13:53:15' WHERE `customers`.`id` = 1

        def set_customer
            @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1