app/controllers/products_controller.rb

INSERT INTO `products` (`pname`, `price`, `unit`, `reorder`, `loc`, `created_at`, `updated_at`, `supplier_id`) VALUES ('product', '10', 'grams', 1, 'a', '2018-04-30 15:05:01', '2018-04-30 15:05:01', 1)
---
    def create
        @product = Product.new(product_params)
        @product.currquantity = 0
        @product.status = 'available'
        if @product.save

UPDATE `products` SET `price` = '11', `updated_at` = '2018-04-30 16:20:18' WHERE `products`.`id` = 1
---
    def update
        if @product.update(product_params)