app/controllers/suppliers_controller.rb

INSERT INTO `suppliers` (`sname`, `saddress`, `scontactn`, `scontactp`, `spayment`, `snotes`, `created_at`, `updated_at`) VALUES ('supplier', 'address', 'contactn', '09171231234', 'p', 'n', '2018-04-30 13:39:21', '2018-04-30 13:39:21')
---
    def create
        @supplier = Supplier.new(supplier_params)
        if @supplier.save

UPDATE `suppliers` SET `saddress` = 'address1', `updated_at` = '2018-04-30 16:20:43' WHERE `suppliers`.`supplier_id` = 1
---
    def update
        if @supplier.update(supplier_params)

SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`supplier_id` = 1 LIMIT 1
---
        def set_supplier
            @supplier = Supplier.find(params[:id])