app/controllers/updates_controller.rb

    def list_s
        @suppliers = Supplier.all
---
SELECT `suppliers`.* FROM `suppliers`

    def list_p
        @products = Product.all
---
SELECT `products`.* FROM `products`

    def list_c
        @customers = Customer.all
---
SELECT `customers`.* FROM `customers`