app/views/products/new.html.erb

SELECT `products`.* FROM `products`
SELECT `suppliers`.* FROM `suppliers`
---
        <%= f.label :supplier %><br>
        <%= collection_select(:product, :supplier_id, Supplier.all, :supplier_id, :sname) %>